phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
x1 = len(phrase_1)
x2 = len(phrase_2)
print('x1=', x1, 'x2=', x2)
if(x1 > x2):
    print('Фраза 1 длиннее фразы 2')

phrase_1 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
x3 = len(phrase_1)
x4 = len(phrase_2)
if(x3 < x4):
    print('Фраза 2 длиннее фразы 1')

phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
x5 = len(phrase_1)
x6 = len(phrase_2)
if(x5 == x6):
    print('Фразы равной длины')



